import { AccordionSectionProps } from "../../components";
import { TranslationType } from "../types";

export const accordionSectionContent1: TranslationType<AccordionSectionProps> =
  {
    ru: {
      title: "FAQ",
      description: "Отвечаем на часто задаваемые вопросы",
      data: [
        {
          title:
            "Кто может подать заявку на компенсацию стоимости языковых курсов?",
          text: "Попросить о финансировании курса могут иностранные граждане как безработные, так и работающие (но желающие работу сменить). Они должны зарегистрироваться в Управлении занятости или как соискатель (uchazeč o zaměstnání), или как заинтересованный (zájemce).",
        },
        {
          title: "А если у меня еще нет визы и я нахожусь не в Чехии?",
          text: "На бесплатной консультации мы рассмотрим вашу ситуацию и предложим несколько вариантов решения для получения подходящего типа визы.",
        },
        {
          title: "В каком формате будет проходить курс?",
          text: "Курсы будут доступны в очном (непосредственно в учебных классах GoStudy в Праге или Брно, по вашему выбору) или онлайн формате. Обучение идет на протяжении 4 недель (базовый курс). Занятия проходят ежедневно с понедельника по пятницу по 3 урока в день (15 академических часов в неделю)",
        },
        {
          title: "Как получить сертификат и что он дает?",
          renderText: () => (
            <>
              Чтобы получить сертификат о знании чешского языка, участники
              должны посетить минимум 80 % занятий. По окончании курса сдается
              экзамен. Для успешной сдачи экзамена необходимо набрать как
              минимум 60 % баллов с письменной и устной части.
              <br />
              <br />
              Наличие сертификата о знании чешского языка поможет с
              трудоустройством и улучшением рабочих условий (специалисты со
              знанием государственного языка выше ценятся на рынке труда, больше
              востребованы у работодателей, а значит могут претендовать на более
              высокую заработную плату).
            </>
          ),
        },
        {
          title: "Кто будет вести курсы?",
          renderText: () => (
            <>
              На курсах преподают квалифицированные педагоги-филологи, носители
              языка с большим опытом преподавания чешского языка как
              иностранного. За подбор учителей и методику курсов отвечают
              высококвалифицированные преподаватели чешского языка со стажем
              более 10 лет.
              <br />
              <br />
              <span style={{ fontWeight: "600" }}>
                Mgr. Jana Hudečková
              </span>{" "}
              (отделение в Праге, онлайн)
              <br />
              Образование: педагогический факультет Карлова университета.
              Преподает чешский язык в GoStudy, ведет марафоны чешского языка,
              проводит мастер-классы по онлайн-обучению, автор подкаста Učíme se
              česky, методист онлайн-программ GoStudy, заведующая отделением
              чешского языка GoStudy в Праге
              <br />
              <br />
              <span style={{ fontWeight: "600" }}>Mgr. Hana Ciosová</span>{" "}
              (отделение в Брно)
              <br />
              Образование: педагогический факультет университета Палацкого.
              Сотрудник Центра оценки результатов образования Министерства
              образования Чехии, преподает чешский язык в GoStudy, заведующая
              отделением чешского языка GoStudy в Брно
            </>
          ),
        },
        {
          title: "Можно ли принять участие в курсах на платной основе?",
          text: "Да, если вы не хотите регистрироваться в Центре занятости или не подходите под получение визы требуемого типа, вы можете принять участие в данных курсах на платной основе. Оценить ваш уровень языка и узнать стоимость вы можете на консультации с экспертом GoStudy.",
        },
        {
          title:
            "Могу ли я принять участие во всех трех курсах, если хочу выучить язык с 0 до B1, и при этом претендовать на компенсацию стоимости от Центра занятости?",
          renderText: () => (
            <>
              Да, вы имеете право на прохождение всех 3х курсов, но для
              оформления на следующий вам потребуется еще раз заполнить
              заявление для Центра занятости, дождаться рассмотрения и только
              после этого продолжить обучение.
              <br />
              <br />
              По факту после каждого курса у вас будут каникулы длиной в 30
              дней. Это время вы сможете использовать с пользой,
              попрактиковаться в чешском и потренировать полученные навыки.
            </>
          ),
        },
      ],
    },
    uk: {
      title: "FAQ",
      description: "Відповідаємо на питання, що часто ставляться",
      data: [
        {
          title: "Хто може подати заяву на компенсацію вартості мовних курсів?",
          text: "Попросити про фінансування курсу можуть іноземні громадяни як безробітні, так і ті, що працюють (але бажають змінити роботу). Їм потрібно зареєструватися в Управлінні зайнятості або як претендент (uchazeč o zaměstnání), або як зацікавлений (zájemce).",
        },
        {
          title: "А якщо я ще не маю візи і я перебуваю не в Чехії?",
          text: "На безкоштовній консультації ми розглянемо вашу ситуацію та запропонуємо кілька варіантів рішення для отримання відповідного типу візи.",
        },
        {
          title: "У якому форматі проходитиме курс?",
          text: "Курси будуть доступні в очному (безпосередньо у навчальних класах GoStudy у Празі або Брно, на ваш вибір) або онлайн форматі. Навчання триває протягом 4 тижнів (базовий курс). Заняття проходять щодня з понеділка до п'ятниці по 3 уроки на день (15 академічних годин на тиждень)",
        },
        {
          title: "Як отримати сертифікат та що він дає?",
          renderText: () => (
            <>
              Щоб отримати сертифікат про знання чеської мови, учасники повинні
              відвідати щонайменше 80% занять. Після закінчення курсу
              складається іспит. Для успішного складання іспиту необхідно
              набрати як мінімум 60% балів з письмової та усної частини.
              <br />
              <br />
              Наявність сертифіката про знання чеської мови допоможе з
              працевлаштуванням та покращенням робочих умов (фахівці зі знанням
              державної мови вище цінуються на ринку праці, більше затребувані у
              роботодавців, а отже, можуть претендувати на більш високу
              заробітну плату).
            </>
          ),
        },
        {
          title: "Хто вестиме курси?",
          renderText: () => (
            <>
              На курсах викладають кваліфіковані педагоги-філологи, носії мови з
              великим досвідом викладання чеської як іноземної. За підбір
              вчителів та методику курсів відповідають висококваліфіковані
              викладачі чеської мови зі стажем понад 10 років.
              <br />
              <br />
              <span style={{ fontWeight: "600" }}>
                Mgr. Jana Hudečková
              </span>{" "}
              (відділення у Празі, онлайн)
              <br />
              Освіта: педагогічний факультет Карлового університету. Викладає
              чеську мову в GoStudy, проводить марафони чеської мови, проводить
              майстер-класи з онлайн-навчання, автор подкасту Učíme se česky,
              методист онлайн-програм GoStudy, завідувачка відділення чеської
              мови GoStudy у Празі
              <br />
              <br />
              <span style={{ fontWeight: "600" }}>Mgr. Hana Ciosová</span>{" "}
              (відділення у Брно)
              <br />
              Освіта: педагогічний факультет університету Палацького.
              Співробітник Центру оцінки результатів освіти Міністерства освіти
              Чехії, викладає чеську мову в GoStudy, завідувачка відділення
              чеської мови GoStudy в Брно.
            </>
          ),
        },
        {
          title: "Чи можна взяти участь у курсах на платній основі?",
          text: "Так, якщо ви не бажаєте реєструватися в Центрі зайнятості або не підходите під отримання візи необхідного типу, ви можете взяти участь у цих курсах на платній основі. Оцінити ваш рівень мови та дізнатися вартість ви можете на консультації з експертом GoStudy.",
        },
        {
          title:
            "Чи можу я взяти участь у всіх трьох курсах, якщо я хочу вивчити мову з 0 до B1, і при цьому претендувати на компенсацію вартості від Центру зайнятості?",
          renderText: () => (
            <>
              Так, ви маєте право на проходження всіх 3-х курсів, але для
              оформлення на наступний вам потрібно ще раз заповнити заяву для
              Центру зайнятості, дочекатися розгляду і тільки після цього
              продовжити навчання.
              <br />
              <br />
              За фактом після кожного курсу у вас будуть канікули довжиною 30
              днів. Цей час ви зможете використати з користю, попрактикуватися у
              чеській та потренувати отримані навички.
            </>
          ),
        },
      ],
    },
  };
