import { List6SectionProps } from "../../components";
import { TranslationType } from "../types";

export const list6SectionContent1: TranslationType<List6SectionProps> = {
  ru: {
    sectionTitle: {
      preTitle: "Как это работает?",
      title: "5 шагов к изучению чешского языка",
    },
    data: {
      postDescription:
        "*По нашему опыту заявление рассматривается в Центре занятости до 30 дней. Сотрудники GoStudy помогут заполнить заявление без ошибок, чтобы получить 100% положительное решение.",
      data: [
        {
          title:
            "Мы оценим вашу визовую ситуацию. Вы можете претендовать на компенсацию стоимости курса в Центре занятости (Úřad práce) при наличии:",
          list: ["визы защиты", "трудовой визы"],
          button: {
            text: "Записаться на консультацию",
          },
        },
        {
          title:
            "Вместе с вами соберем документы для регистрации в Центре занятости (Úřad práce)",
        },
        {
          title:
            "Мы поможем правильно составить заявление и подберем подходящий курс в зависимости от вашего уровня языка.",
        },
        {
          title:
            "Вы вносите регистрационный взнос в размере 500 CZK, который будет возвращен после завершения курса",
        },
        {
          title:
            "После рассмотрения заявления вы сможете начать обучение чешскому языку в нашем центре",
          isHighlighted: true,
        },
      ],
    },
  },
  uk: {
    sectionTitle: {
      preTitle: "Як це працює?",
      title: "5 кроків до вивчення чеської мови",
    },
    data: {
      postDescription:
        "*З нашого досвіду заява розглядається у Центрі зайнятості до 30 днів. Співробітники GoStudy допоможуть заповнити заяву без помилок, щоб отримати 100% позитивне рішення.",
      data: [
        {
          title:
            "Ми оцінимо вашу візову ситуацію. Ви можете претендувати на компенсацію вартості курсу в Центрі зайнятості (Úřad práce) за наявності:",
          list: ["візи захисту", "трудової візи"],
          button: {
            text: "Записатися на консультацію",
          },
        },
        {
          title:
            "Разом із вами зберемо документи для реєстрації у Центрі зайнятості (Úrad práce)",
        },
        {
          title:
            "Ми допоможемо правильно скласти заяву та підберемо відповідний курс залежно від вашого рівня мови.",
        },
        {
          title:
            "Ви вносите реєстраційний внесок у розмірі 500 CZK, який буде повернено після завершення курсу",
        },
        {
          title:
            "Після розгляду заяви ви зможете розпочати вивчення чеської мови у нашому центрі",
          isHighlighted: true,
        },
      ],
    },
  },
};
