import { List5SectionProps } from "../../components";
import { TranslationType } from "../types";

export const list5SectionContent1: TranslationType<List5SectionProps> = {
  ru: {
    sectionTitle: {
      preTitle: "Курсы",
      title: "Для любого уровня языковой подготовки",
    },
    data: [
      {
        badge: "с 0 до А1",
        title: "Базовый курс",
        description: "Základní kurz",
        list: [
          "60 часов изучения языка",
          "c 0 до A1",
          "в Праге, Брно и онлайн",
          "100% компенсация стоимости курса",
          "Сертификат по окончании",
          "Комфортное расписание занятий",
        ],
        button: {
          text: "Записаться на курс",
        },
      },
      {
        badge: "c A1 до A2",
        title: "Продолжающий курс с А1 до А2",
        description: "Navazující kurz",
        list: [
          "120 часов изучения языка",
          "c A1 до A2",
          "в Праге, Брно и онлайн",
          "100% компенсация стоимости курса",
          "Сертификат по окончании",
          "Комфортное расписание занятий",
        ],
        button: {
          text: "Записаться на курс",
        },
      },
      {
        badge: "c A2 до B1",
        title: "Углубленный курс с А2 до B1",
        description: "Pro pokročilé",
        list: [
          "150 часов изучения языка",
          "c A2 до B1",
          "в Праге, Брно и онлайн",
          "100% компенсация стоимости курса",
          "Сертификат по окончании",
          "Комфортное расписание занятий",
        ],
        button: {
          text: "Записаться на курс",
        },
      },
    ],
  },
  uk: {
    sectionTitle: {
      preTitle: "Курси",
      title: "Для будь-якого рівня мовної підготовки",
    },
    data: [
      {
        badge: "З 0 до А1",
        title: "Базовий курс",
        description: "",
        list: [
          "60 годин вивчення мови",
          "з 0 до A1",
          "в Празі, Брно та онлайн",
          "100% компенсація вартості курсу",
          "Сертифікат після закінчення",
          "Комфортний розклад занять",
        ],
        button: {
          text: "Записатися на курс",
        },
      },
      {
        badge: "З А1 до А2",
        title: "Тривалий курс від А1 до А2",
        description: "Navazující kurz",
        list: [
          "120 годин вивчення мови",
          "з A1 до A2",
          "в Празі, Брно та онлайн",
          "100% компенсація вартості курсу",
          "Сертифікат після закінчення",
          "Комфортний розклад занять",
        ],
        button: {
          text: "Записатися на курс",
        },
      },
      {
        badge: "З А2 до B1",
        title: "Поглиблений курс від А2 до B1",
        description: "Pro pokročilé",
        list: [
          "150 годин вивчення мови",
          "з A2 до B1",
          "в Празі, Брно та онлайн",
          "100% компенсація вартості курсу",
          "Сертифікат після закінчення",
          "Комфортний розклад занять",
        ],
        button: {
          text: "Записатися на курс",
        },
      },
    ],
  },
};
